//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьДатаРожденияРавная(Парам01)","УМеняЕстьДатаРожденияРавная","Допустим у меня есть дата рождения равная 13.12.1975");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ТекущаяДатаРавная(Парам01)","ТекущаяДатаРавная","и текущая дата равная 21.09.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатРасчетаБудетРавен(Парам01)","РезультатРасчетаБудетРавен","Тогда результат расчета будет равен 488");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим у меня есть дата рождения равная 13.12.1975
//@УМеняЕстьДатаРожденияРавная(Парам01)
Процедура УМеняЕстьДатаРожденияРавная(Парам01) Экспорт
	Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Контекст.Вставить("ДатаРождения",Дата(Парам01));
КонецПроцедуры

&НаКлиенте
//и текущая дата равная 21.09.2016
//@ТекущаяДатаРавная(Парам01)
Процедура ТекущаяДатаРавная(Парам01) Экспорт
	Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Контекст.Вставить("ТекущаяДата",Дата(Парам01));
КонецПроцедуры

&НаКлиенте
//Тогда результат расчета будет равен 488
//@РезультатРасчетаБудетРавен(Парам01)
Процедура РезультатРасчетаБудетРавен(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Сообщить(Парам01);
	Результат = ОбщийМодуль1.РассчитатьВозрастВМесяцах(Контекст.ДатаРождения,Контекст.ТекущаяДата);
	Сообщить(Результат);
	Если Не Результат=Парам01 тогда
		ВызватьИсключение "Результат расчитан неверно";
	КонецЕсли;	
КонецПроцедуры

//окончание текста модуля